WMSGIFT/src/Catalogs/ГрафикиРаботыСотрудников/ГрафикиРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГрафикиРаботыСотрудников</name>
  <attributes>
    <name>СменныйГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеОРабочихЧасах</name>
    <attributes>
      <name>НомерДняЦикла</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени</name>
      <type>
        <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Часов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыВремени</name>
    <attributes>
      <name>ВидВремени</name>
      <type>
        <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

WMSGIFT/src/InformationRegisters/ГрафикиРаботыПоВидамВремени/ГрафикиРаботыПоВидамВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботыПоВидамВремени</name>
  <resources>
    <name>ОсновноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеЗначениеНорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначениеНорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.итWMSРаботникиСклада</types>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчетаВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяВЧасах</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВЦеломЗаПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПереходящаяЧастьПредыдущейСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПереходящаяЧастьТекущейСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WMSGIFT/src/Catalogs/ВидыИспользованияРабочегоВремени/ВидыИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыИспользованияРабочегоВремени</name>
  <predefined>
    <items>
      <name>Болезнь</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>Болезнь без оплаты</description>
    </items>
    <items>
      <name>Вахта</name>
      <description>Вахта</description>
    </items>
    <items>
      <name>ВынужденныйПрогул</name>
      <description>Вынужденный прогул</description>
    </items>
    <items>
      <name>ВыходныеДни</name>
      <description>Выходные дни</description>
    </items>
    <items>
      <name>ГосударственныеОбязанности</name>
      <description>Государственные обязанности</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
      <description>Дополнительные выходные дни не оплачиваемые</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниОплачиваемые</name>
      <description>Дополнительные выходные дни оплачиваемые</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>Дополнительный отпуск</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>Забастовка</description>
    </items>
    <items>
      <name>ЗадержкаВыплатыЗаработнойПлаты</name>
      <description>Задержка выплаты заработной платы</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>КормлениеРебенка</name>
      <description>Кормление ребенка</description>
    </items>
    <items>
      <name>НеоплачиваемыйДополнительныйОтпуск</name>
      <description>Неоплачиваемый дополнительный отпуск</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>Неоплачиваемый отпуск по законодательству</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>Неоплачиваемый отпуск по разрешению работодателя</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>Неявки по невыясненным причинам</description>
    </items>
    <items>
      <name>ОплачиваемыеНерабочиеДни</name>
      <description>Оплачиваемые нерабочие дни</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>Основной отпуск</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>Отпуск на обучение</description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>Отпуск на обучение неоплачиваемый</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>Отпуск по уходу за ребенком</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыБезОплаты</name>
      <description>Отстранение от работы без оплаты</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыСОплатой</name>
      <description>Отстранение от работы с оплатой</description>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
      <description>Повышение квалификации</description>
    </items>
    <items>
      <name>ПовышениеКвалификацииВДругойМестности</name>
      <description>Повышение квалификации в другой местности</description>
    </items>
    <items>
      <name>Праздники</name>
      <description>Праздники</description>
    </items>
    <items>
      <name>ПраздникиБезПовышеннойОплаты</name>
      <description>Праздники без повышенной оплаты</description>
    </items>
    <items>
      <name>Прогулы</name>
      <description>Прогулы</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Простой</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботника</name>
      <description>Простой по вине работника</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой по вине работодателя</description>
    </items>
    <items>
      <name>РаботаВРежимеНеполногоВремени</name>
      <description>Работа в режиме неполного времени</description>
    </items>
    <items>
      <name>РаботаВечерниеЧасы</name>
      <description>Работа вечерние часы</description>
    </items>
    <items>
      <name>РаботаНочныеЧасы</name>
      <description>Работа ночные часы</description>
    </items>
    <items>
      <name>РабочееВремя</name>
      <description>Рабочее время</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>Сверхурочные</description>
    </items>
    <items>
      <name>СверхурочныеБезПовышеннойОплаты</name>
      <description>Сверхурочные без повышенной оплаты</description>
    </items>
    <items>
      <name>СокращенноеВремяОбучающихся</name>
      <description>Сокращенное время обучающихся</description>
    </items>
    <items>
      <name>СокращенноеРабочееВремя</name>
      <description>Сокращенное рабочее время</description>
    </items>
    <items>
      <name>Явка</name>
      <description>Явка</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеВремя</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Целосменное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

WMSGIFT/src/Catalogs/ГрафикиРаботыСотрудников/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	ЗаполнитьВидыВремениГрафика();
КонецПроцедуры

Процедура ЗаполнитьВидыВремениГрафика()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиРаботыСотрудниковДанныеОРабочихЧасах.ВидВремени КАК ВидВремени
		|ИЗ
		|	Справочник.ГрафикиРаботыСотрудников.ДанныеОРабочихЧасах КАК ГрафикиРаботыСотрудниковДанныеОРабочихЧасах
		|ГДЕ
		|	ГрафикиРаботыСотрудниковДанныеОРабочихЧасах.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикиРаботыСотрудниковДанныеОРабочихЧасах.ВидВремени";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВидыВремени.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока=ВидыВремени.Добавить();
		НоваяСтрока.ВидВремени=ВыборкаДетальныеЗаписи.ВидВремени;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьТабличныйДокументГрафика(ТабличныйДокумент,Год) Экспорт 
	ТабличныйДокумент=новый ТабличныйДокумент;
	Макет=ПолучитьМакет("ШаблонГрафика");
	ШапкаОбщая=Макет.ПолучитьОбласть("Шапка|Основная");
	ТабличныйДокумент.Вывести(ШапкаОбщая);
	для n=0 по 30 Цикл 
		ШапкаДень=Макет.ПолучитьОбласть("Шапка|День");
		ШапкаДень.Параметры.ДеньШапка=n+1;
		ТабличныйДокумент.Присоединить(ШапкаДень);
	КонецЦикла;
	ДатаГода=Дата(Год,01,01);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиРаботыПоВидамВремени.Месяц КАК Месяц,
		|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ГрафикиРаботыПоВидамВремени.Дата КАК Дата,
		|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение КАК ДополнительноеЗначение
		|ПОМЕСТИТЬ ВтГрафик
		|ИЗ
		|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
		|	И ГрафикиРаботыПоВидамВремени.Месяц МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрафикиРаботыСотрудниковВидыВремени.ВидВремени КАК ВидВремени
		|ПОМЕСТИТЬ ВтВидыВремени
		|ИЗ
		|	Справочник.ГрафикиРаботыСотрудников.ВидыВремени КАК ГрафикиРаботыСотрудниковВидыВремени
		|ГДЕ
		|	ГрафикиРаботыСотрудниковВидыВремени.Ссылка = &ГрафикРаботы
		|	И ГрафикиРаботыСотрудниковВидыВремени.ВидВремени <> ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.ВыходныеДни)
		|	И ГрафикиРаботыСотрудниковВидыВремени.ВидВремени <> ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтГрафик.Месяц КАК Месяц,
		|	ВтГрафик.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ВтГрафик.Дата КАК Дата
		|ПОМЕСТИТЬ ВтРабочиеВыходныеДни
		|ИЗ
		|	ВтГрафик КАК ВтГрафик
		|ГДЕ
		|	(ВтГрафик.ВидУчетаВремени = ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.ВыходныеДни)
		|			ИЛИ ВтГрафик.ВидУчетаВремени = ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтГрафик.Месяц,
		|	ВтГрафик.ВидУчетаВремени,
		|	ВтГрафик.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтГрафик.Месяц КАК Месяц,
		|	ВтГрафик.Дата КАК Дата,
		|	ВтВидыВремени.ВидВремени КАК ВидВремени
		|ПОМЕСТИТЬ ГрафикДанные
		|ИЗ
		|	ВтГрафик КАК ВтГрафик
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВидыВремени КАК ВтВидыВремени
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтГрафик.Месяц,
		|	ВтГрафик.Дата,
		|	ВтВидыВремени.ВидВремени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтГрафик.Месяц КАК Месяц,
		|	ВтГрафик.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ВтГрафик.Дата КАК Дата,
		|	ВтГрафик.ДополнительноеЗначение КАК ДополнительноеЗначение
		|ПОМЕСТИТЬ ГрафикВидыВремени
		|ИЗ
		|	ВтГрафик КАК ВтГрафик
		|ГДЕ
		|	ВтГрафик.ВидУчетаВремени <> ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.ВыходныеДни)
		|	И ВтГрафик.ВидУчетаВремени <> ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрафикДанные.Месяц КАК Месяц,
		|	ГрафикДанные.Дата КАК Дата,
		|	ВтРабочиеВыходныеДни.ВидУчетаВремени КАК ВидДня,
		|	ГрафикДанные.ВидВремени КАК ВидУчетаВремени,
		|	ГрафикВидыВремени.ДополнительноеЗначение КАК ДополнительноеЗначение
		|ИЗ
		|	ГрафикДанные КАК ГрафикДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеВыходныеДни КАК ВтРабочиеВыходныеДни
		|		ПО ГрафикДанные.Месяц = ВтРабочиеВыходныеДни.Месяц
		|			И ГрафикДанные.Дата = ВтРабочиеВыходныеДни.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикВидыВремени КАК ГрафикВидыВремени
		|		ПО ГрафикДанные.Месяц = ГрафикВидыВремени.Месяц
		|			И ГрафикДанные.Дата = ГрафикВидыВремени.Дата
		|			И ГрафикДанные.ВидВремени = ГрафикВидыВремени.ВидУчетаВремени
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикДанные.Месяц,
		|	ГрафикДанные.Дата,
		|	ГрафикВидыВремени.ДополнительноеЗначение,
		|	ВтРабочиеВыходныеДни.ВидУчетаВремени,
		|	ГрафикДанные.ВидВремени
		|ИТОГИ ПО
		|	Месяц,
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтВидыВремени.ВидВремени КАК ВидВремени
		|ИЗ
		|	ВтВидыВремени КАК ВтВидыВремени";
	
	Запрос.УстановитьПараметр("ГрафикРаботы", Ссылка);
    Запрос.УстановитьПараметр("ДатаНачала",ДатаГода);
	Запрос.УстановитьПараметр("ДатаОкончания",КонецГода(ДатаГода));

	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаВидовВремени=МассивРезультатов[6].Выбрать();
	ВыборкаПоМесяцам=МассивРезультатов[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоВидовВремени=МассивРезультатов[6].Выгрузить().Количество();
	Пока ВыборкаПоМесяцам.Следующий() Цикл
		ТабличныйДокМесяца=новый ТабличныйДокумент;
		ОбластьСтрокаМесяца=Макет.ПолучитьОбласть("СтрокаМесяц");
		ОбластьСтрокаМесяца.Параметры.Месяц=Формат(ВыборкаПоМесяцам.Месяц,"ДФ='ММММ'");
		ТабличныйДокМесяца.Вывести(ОбластьСтрокаМесяца);
		Если КоличествоВидовВремени >1 Тогда  
			Для n=2 по КоличествоВидовВремени Цикл 
				ОбластьСтрокаМесяца=Макет.ПолучитьОбласть("СтрокаМесяц");
				ТабличныйДокМесяца.Вывести(ОбластьСтрокаМесяца);
			КонецЦикла;
		КонецЕсли;
		ВыборкаВидовВремени.Сбросить();
		ТабличныйДокументВидовВремени=новый ТабличныйДокумент;
		Пока ВыборкаВидовВремени.Следующий() Цикл 
		ОбластьСтрокаВидВремени=Макет.ПолучитьОбласть("ВидВремениСтрока");
		ОбластьСтрокаВидВремени.Параметры.ВидВремени=ВыборкаВидовВремени.ВидВремени;
		ТабличныйДокументВидовВремени.Вывести(ОбластьСтрокаВидВремени);
		КонецЦикла;
		ТаблицаДеньЧас=новый ТабличныйДокумент;
		Для n=1 по КоличествоВидовВремени Цикл 
			ОбластьСтрокаДень=Макет.ПолучитьОбласть("ДеньСТрока");
			ОбластьСтрокаЧас=Макет.ПолучитьОбласть("ЧасСтрока");
            ТаблицаДеньЧас.Вывести(ОбластьСтрокаДень);
			ТаблицаДеньЧас.Присоединить(ОбластьСтрокаЧас);
		КонецЦикла;
		ТабличныйДокумент.Вывести(ТабличныйДокМесяца.ПолучитьОбласть(1,1,ТабличныйДокМесяца.ВысотаТаблицы,ТабличныйДокМесяца.ШиринаТаблицы));
		ТабличныйДокумент.Присоединить(ТабличныйДокументВидовВремени);
		ТабличныйДокумент.Присоединить(ТаблицаДеньЧас);
		ВыборкаДень=ВыборкаПоМесяцам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДень.Следующий() Цикл
		ТабличныйДокументДень=новый ТабличныйДокумент;	
			
			ВыборкаДетальная=ВыборкаДень.Выбрать();
			СчетчикЗаписей=0;
			ВыходнойДень=Ложь;
			Пока ВыборкаДетальная.Следующий() Цикл
				СчетчикЗаписей=СчетчикЗаписей+1;
				ОбластьДняПоВидуВремени=Макет.ПолучитьОбласть("ДанныеДняСтрока");
				ОбластьДняПоВидуВремени.Параметры.ДанныеДня=ВыборкаДетальная.ДополнительноеЗначение;
				Если ВыборкаДетальная.ВидДня=Справочники.ВидыИспользованияРабочегоВремени.ВыходныеДни Тогда 
					ВыходнойДень=Истина;
					ОбластьДняПоВидуВремени.Область(1,1,ОбластьДняПоВидуВремени.ВысотаТаблицы,ОбластьДняПоВидуВремени.ШиринаТаблицы).ЦветФона=WebЦвета.Кремовый;
				КонецЕсли;	
				ТабличныйДокументДень.Вывести(ОбластьДняПоВидуВремени);
            КонецЦикла;
			Пока СчетчикЗаписей<КоличествоВидовВремени Цикл 
				ОбластьДняПоВидуВремени=Макет.ПолучитьОбласть("ДанныеДняСтрока");
				Если ВыходнойДень Тогда 
					ОбластьДняПоВидуВремени.Область(1,1,ОбластьДняПоВидуВремени.ВысотаТаблицы,ОбластьДняПоВидуВремени.ШиринаТаблицы).ЦветФона=WebЦвета.Кремовый;
				КонецЕсли;
				ТабличныйДокументДень.Вывести(ОбластьДняПоВидуВремени);	
				СчетчикЗаписей=СчетчикЗаписей+1;
			КонецЦикла;
		ТабличныйДокумент.Присоединить(ТабличныйДокументДень);	
        КонецЦикла;
	КонецЦикла;
	

	КонецПроцедуры
